# =========================
# 在庫回転率計算
# 在庫回転率 在庫が0の時の除算エラー防止
# 月間売上 / 在庫数
# =========================

def calc_turnover(row):

    # 在庫が0であれば、0を返して終了
    if row['在庫数'] == 0:
        return 0

    # round(..., 2) 小数第3位を四捨五入して小数第2位まで表示
    return round(
        row['月間売上'] / row['在庫数'], 2
    )


# =========================
# 分析処理メイン（列作成）
# =========================

def analyze_inventory(df):

    # 売上金額 商品ごとの月間売上総額
    # 月間売上 ｘ 販売単価
    df['売上金額'] = (df['月間売上'] * df['販売単価'])

    # 欠品リスク 在庫が1週間分の売上（1ヶ月の1/4）未満になると True
    # 在庫数 < 月間売上 / 4
    df['欠品リスク'] = (df['在庫数'] < (df['月間売上'] / 4))

    # 過剰在庫 現在の在庫数が3ヶ月分の売上（1ヶ月の3倍）を上回ると True
    # 在庫数 > 月間売上 x 3
    df['過剰在庫'] = (df['在庫数'] > (df['月間売上'] * 3))

    # 発注推奨数 .clip(lower=0) 引き算の結果がマイナス（在庫が足りている場合）は 0
    # 月間売上 - 在庫数
    df['発注推奨数'] = (df['月間売上'] - df['在庫数']).clip(lower=0)

    # 在庫回転率 在庫が0の時の除算エラー防止
    # 月間売上 / 在庫数
    df['在庫回転率'] = df.apply(calc_turnover, axis=1)


    # =========================
    # ABCランク判定
    # =========================

    def abc_rank(rate):

        # Aランク: 売上の上位70%を占める主力商品
        if rate <= 0.7:
            return 'A'

        # Bランク: 売上の70%〜90%を占める準主力商品
        elif rate <= 0.9:
            return 'B'
        
        # Cランク: 残りの10%（90%〜100%）を占める、売上貢献度の低い商品
        else:
            return 'C'


    # =========================
    # ABC分析（列作成）
    # =========================

    # 売上金額順に並び替え
    df = df.sort_values(by='売上金額', ascending=False)

    # 総売上金額
    total_sales = df['売上金額'].sum()

    # .cumsum() 上から順番に値を足す処理
    df['累積売上'] = df['売上金額'].cumsum()

    # 累積売上を総売上で割る
    df['累積比率'] = (df['累積売上'] / total_sales)

    # 累積比率を元にabc_rank関数でランクを割り当てる
    df['ABCランク'] = (df['累積比率'].apply(abc_rank))


    return df